#+Title: Typed Lisp, A Primer
# AlBasmala does not allow “:” in a title.
# AlBasmala allows a subtitle or an image, not both.
#+Description: Exploring Lisp's fine-grained type hierarchy.
#+DATE: 2019-08-21
#+AUTHOR: Musa Al-hassy
#+EMAIL: alhassy@gmail.com
#+OPTIONS: html-postamble:nil toc:nil d:nil
#+LATEX_HEADER: \usepackage[margin=0.5in]{geometry}

# ─AlBasmala keywords─
# DRAFT: yes
#+SOURCEFILE: https://github.com/alhassy/ElispCheatSheet/TypedLisp.org
#+IMAGE: ../assets/img/emacs-birthday-present.png
#+IMAGEHEIGHT: 350
#+IMAGEWIDTH: 350
#+CATEGORIES: Types Lisp ProgramProving

# Show me the html, dont make latex
# (my/publish-to-blog t t)
# (find-file "~/alhassy.github.io/content/AlBasmala.el")
:push_all_remotely:
#+BEGIN_SRC emacs-lisp
(let ((org-latex-listings 'minted)
      (org-latex-packages-alist '(("" "minted")))
      (org-latex-pdf-process
      '("pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
        "biber %b"
        "pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f"
        "pdflatex -interaction nonstopmode -shell-escape -output-directory %o %f")))

  (add-to-list 'org-src-lang-modes '("math" . haskell))
  (my/publish-to-blog nil nil))
#+END_SRC
:End:

* COMMENT How using ~compile~ can increase speed :experiment:
#+BEGIN_SRC emacs-lisp
;; https://lists.gnu.org/archive/html/help-gnu-emacs/2008-06/msg00087.html
(defmacro measure-time (&rest body)
  "Measure the time it takes to evaluate BODY."
  `(let ((time (current-time)))
     ,@body
     (message "%.06f seconds" (float-time (time-since time)))))

(setf a (make-vector 1000000 1.0))

(defun sum-elts (a)
  (let ((sum 0.0))
    (dotimes (r 1000000)
        (incf sum (aref a r)))
    sum))

(measure-time (sum-elts a)) ;; ⇒ 0.534579 seconds

(byte-compile 'sum-elts)
(measure-time (sum-elts a)) ;; ⇒ 0.238634 seconds
#+END_SRC

#+RESULTS:
: 0.000002

So there is no way to "compile the same definition again."
https://ftp.gnu.org/old-gnu/Manuals/elisp-manual-20-2.5/html_node/elisp_197.html
